{"riddle": "What can point in every direction but can't reach the destination by itself.", "answer": "Your finger"}
{"riddle":"What 8 letter word can have a letter taken away and it still makes a word.  Take another letter away and it still makes a word. Keep on doing that until you have one letter left. What is the word?", "answer":"The word is starting! starting, staring, string, sting, sing, sin, in, I."}
{"riddle":"The more you take, the more you leave behind. What am I?","answer":"Footsteps"}
{"riddle":"What has a head, a tail, is brown, and has no legs?","answer":"A Penny"}
{"riddle":"What comes once in a minute, twice in a moment, but never in a thousand years?","answer":"The letter m"}
{"riddle":"David's father has three sons : Snap, Crackle and _____ ?","answer":"David"}
{"riddle":"What room do ghosts avoid?","answer":"The living room"}
{"riddle":"What has many keys, but can't even open a single door?","answer":"A piano"}
{"riddle":"You live in a one story house made entirely of redwood. What color would the stairs be?","answer":"What stairs? You live in a one story house"}
{"riddle":"I am taken from a mine, and shut up in a wooden case, from which I am never released, and yet I am used by almost everybody.","answer":"Pencil lead"}
{"riddle":"A man rode out of town on Sunday, he stayed a whole night at a hotel and rode back to town the next day on Sunday. How is this possible?","answer":"His Horse was called Sunday!"}
{"riddle":"What is black when you buy it, red when you use it, and gray when you throw it away?","answer":"Charcoal"}
{"riddle":"What belongs to you, but other people use it more than you?","answer":"Your name"}
{"riddle":"Tall I am young, Short I am old, While with life I glow, Wind is my foe. What am I?","answer":"A candle"}
{"riddle":"I am not alive, but I grow; I don't have lungs, but I need air; I don't have a mouth, but water kills me. What am I?","answer":"Fire"}
{"riddle":"What is more useful when it is broken?","answer":"An egg"}
{"riddle":"They have not flesh, nor feathers, nor scales, nor bone. Yet they have fingers and thumbs of their own. What are they?","answer":"Gloves"}
{"riddle":"What has six faces, But does not wear makeup. It also has twenty-one eyes, But cannot see?","answer":"A die (dice)"}
{"riddle":"Before Mount Everest was discovered, what was the highest mountain on Earth?","answer":"Mount Everest"}
{"riddle":"How do you spell candy in 2 letters ?","answer":"c and y c(and)y."}
{"riddle":"What did Mrs. Claus say to Santa when she looked up in the sky?","answer":"Looks like rain dear"}
{"riddle":"This is as light as a feather, yet no man can hold it for long. What am I?","answer":"Your Breath"}
{"riddle":"How do you make the number 7 an even number without addition, subtraction, multiplication or division?","answer":"Drop the S"}
{"riddle":"I am full of holes but I can still hold water. What am I?","answer":"A sponge!"}
{"riddle":"What does a snowman like to eat for breakfast?","answer":"Frosted Flakes"}
{"riddle":"What travels around the world but stays in one spot?","answer":"A stamp"}
{"riddle":" have a little house in which I live all alone. It has no doors or windows, and if I want to go out I must break through the wall. What am I?","answer":"A chick in an egg"}
{"riddle":"Five apples are in a basket. How do you divide them among five girls so that each girl gets an apple, but one apple remains in the basket?","answer":"Give the fifth girl her apple in the basket"}
{"riddle":"What 7 letter word is spelled the same way backwards and forewords?","answer":"Racecar"}
{"riddle":"I can be cracked, I can be made. I can be told, I can be played. What am I?","answer":"A Joke"}
{"riddle":"What do mathematics teachers like to eat?","answer":"Pi"}
{"riddle":"A farmer has 17 sheep and all but 9 die. How many are left alive?","answer":"9"}
{"riddle":"Flat as a leaf, round as a ring; Has two eyes, can't see a thing. What is it?","answer":"A button"}
{"riddle":"A box without hinges, key or lid, Yet golden treasure inside is hid. What am I?","answer":"An egg"}
{"riddle":"What goes up but never comes down?","answer":"Age"}
{"riddle":"Look in my face, I am somebody; Look in my back, I am nobody. What am I?","answer":"I am a mirror"}
{"riddle":"Until I am measured I am not known, Yet how you miss me when I have flown.  What Am I?","answer":"Time"}
{"riddle":"What runs without legs?","answer":"Water"}
{"riddle":"What weighs more? A pound of feathers or a pound of stones?","answer":"Same"}
{"riddle":"I am white when I am dirty, and black when I am clean. What am I?","answer":"Blackboard"}
{"riddle":"If you drop me, I'm sure to crack. Give me a smile, and I'll always smile back. What am I?","answer":"A mirror"}
{"riddle":"Why can't the world ever come to an end?","answer":"Because it's round"}
{"riddle":"Where do you take a sick boat?","answer":"To the dock"}
{"riddle":"I have two hands, but I can not scratch myself. What am I?","answer":"A clock"}
{"riddle":"What type of music do rabbits listen to?","answer":"Hip hop"}
{"riddle":"No matter how little or how much you use me, you change me every month. What am I?","answer":"A Calendar"}
{"riddle":"What has a heart but no other organs?","answer":"A deck of cards"}
{"riddle":"What four-legged animal can jump higher than a house?","answer":"Any, Houses can't jump"}
{"riddle":"I pass before the sun, yet make no shadow. What am I?","answer":"The wind"}
{"riddle":"What is so delicate that saying its name breaks it?","answer":"Silence"}
